package com.company.java009;

//1. 클래스는 부품 객체
//2. 클래스는 속성(멤버변수)과 행위(멤버함수)를 갖는다 

class A1{}

//////////////////////////////////////////////////////
public class Class001 {

	public static void main(String[] args) { //jvm - main 구동 시작점
		int i = 10;
		A1 a = new A1(); //4-1. new (heap 1번지 공간 빌리기, 객체 생성)
						 //4-2. A1() 초기화
						 //4-3. a에 1번지 주소 주기
		System.out.println(a); //A1@5305068a
		A1 a2 = new A1();
		A1 a3 = new A1();
	}

}
/////////////////////////////////////////////////////
/*[runtime data area]
-----------------------------------------------------
[method : 정보, static, final(공용 공간)]	1)
	A1.class, Class001.class	2)						클래스 : 설계도
-----------------------------------------------------
[heap : 동적]				[stack : 임시(잠깐 빌리기)] 	객체(전체) : a a2 a3
														인스턴스(개별) : a, a2, a3
3번지 A1{}				<-		a[3번지]			
2번지(new) A1{}(초기화)	<-		a2[2번지]
1번지 A1{}				<-		a[1번지]
								i[10]
							|main	3)
	 
-----------------------------------------------------
 */